In [95]:
import pandas as pd 
import numpy as np

In [96]:
df = pd.read_csv("StudentsPerformance_irregular.csv")

In [97]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,group C,some college,standard,completed,69.0,90.0,88.0
2,female,group B,master's degree,standard,none,90.0,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0
4,male,group C,some college,standard,none,76.0,78.0,75.0

In [98]:
df.isnull().sum()

gender                          0
race/ethnicity                  0
parental level of education     0
lunch                           0
test preparation course         0
math score                     50
reading score                  50
writing score                  50
dtype: int64

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1005 entries, 0 to 1004
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1005 non-null   object
 1   race/ethnicity               1005 non-null   object
 2   parental level of education  1005 non-null   object
 3   lunch                        1005 non-null   object
 4   test preparation course      1005 non-null   object
 5   math score                   955 non-null    float64
 6   reading score                955 non-null    float64
 7   writing score                955 non-null    float64
dtypes: float64(3), object(5)
memory usage: 62.9+ KB

In [100]:
df.describe(include="all")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1005,1005,1005,1005,1005,955.000000,955.000000,955.000000
unique,7,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,517,320,227,647,646,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,66.453403,69.015707,68.029319
std,NaN,NaN,NaN,NaN,NaN,16.270212,14.597850,15.154729
min,NaN,NaN,NaN,NaN,NaN,-10.000000,17.000000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,57.000000,59.000000,57.000000
50%,NaN,NaN,NaN,NaN,NaN,66.000000,70.000000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,77.000000,79.000000,78.000000
max,NaN,NaN,NaN,NaN,NaN,200.000000,100.000000,100.000000

In [101]:
df.shape

(1005, 8)

## DATA CLEANING

### Standardize column names

In [102]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [103]:
# strip is used for removing leading and trailing spaces
df.columns = df.columns.str.strip()

In [104]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [105]:
# lower is used for lower casing the column name
df.columns = df.columns.str.lower()

In [106]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [107]:
# replace is used for replacing spaces with underscore
df.columns = df.columns.str.replace(" ","_")
df.columns

Index(['gender', 'race/ethnicity', 'parental_level_of_education', 'lunch',
       'test_preparation_course', 'math_score', 'reading_score',
       'writing_score'],
      dtype='object')

In [108]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,group C,some college,standard,completed,69.0,90.0,88.0
2,female,group B,master's degree,standard,none,90.0,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0
4,male,group C,some college,standard,none,76.0,78.0,75.0

### Trim & standardize categorical columns

In [109]:
cat_cols = [
    "gender",
    "parental_level_of_education",
    "lunch",
    "test_preparation_course"
]

for col in cat_cols:
    df[col] = df[col].astype(str).str.strip().str.lower()

# astype(str) converts all the categorical values into string

In [110]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,group C,some college,standard,completed,69.0,90.0,88.0
2,female,group B,master's degree,standard,none,90.0,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0
4,male,group C,some college,standard,none,76.0,78.0,75.0

### Conver scores columns into numeric

In [111]:
score_cols = ["math_score","reading_score","writing_score"]

for col in score_cols:
    df[col] = pd.to_numeric(df[col], errors="coerce")

In [112]:
df[score_cols].isna().sum()

math_score       50
reading_score    50
writing_score    50
dtype: int64

### Handling missing values

In [113]:
df.isnull().sum()

gender                          0
race/ethnicity                  0
parental_level_of_education     0
lunch                           0
test_preparation_course         0
math_score                     50
reading_score                  50
writing_score                  50
dtype: int64

In [114]:
# inplace is used to set whetheer the changes are to be permanent(true) or not(false)
df.dropna(subset=score_cols,inplace = True)

In [115]:
df.shape

(862, 8)

### Remove Duplicates

In [116]:
df.drop_duplicates(inplace = True)

In [117]:
df.shape

(858, 8)

### Feature Engineering

In [118]:
# making an average scores column for all scores
df["average_score"] = df[score_cols].mean(axis=1)

In [119]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,average_score
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,72.666667
1,female,group C,some college,standard,completed,69.0,90.0,88.0,82.333333
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,92.666667
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,49.333333
4,male,group C,some college,standard,none,76.0,78.0,75.0,76.333333

In [120]:
# making a new performance category column
# bins are used for making ranges of values and according to bins, the labels are assigned
# pd.cut is used to make parts or clusters of dataset
df["performance_category"] = pd.cut(
    df["average_score"],
    bins = [0,40,60,80,100],
    labels = ["poor", "average","good","excellent"]
)

In [121]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,average_score,performance_category
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,72.666667,good
1,female,group C,some college,standard,completed,69.0,90.0,88.0,82.333333,excellent
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,92.666667,excellent
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,49.333333,average
4,male,group C,some college,standard,none,76.0,78.0,75.0,76.333333,good

### Outlier Handling

In [122]:
# logical validation
df[["math_score","reading_score","writing_score"]].describe()

       math_score  reading_score  writing_score
count  858.000000     858.000000     858.000000
mean    66.411422      69.272727      68.125874
std     16.275622      14.461319      15.028188
min    -10.000000      23.000000      15.000000
25%     57.000000      59.000000      58.000000
50%     66.000000      70.000000      69.000000
75%     76.000000      79.000000      79.000000
max    200.000000     100.000000     100.000000

In [123]:
# creating a new invalid_scores dataframe which stores all invalid values(Outliers) in our dataset
# further we check the shape of inavlid_scores to see rows and columns
invalid_scores = df[
    (df["math_score"] < 0) | (df["math_score"] > 100) |
    (df["reading_score"] < 0) | (df["reading_score"] > 100) |
    (df["writing_score"] < 0) | (df["writing_score"] > 100)
]

invalid_scores.shape

(5, 10)

In [124]:
invalid_scores

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,average_score,performance_category
335,female,group B,some college,free/reduced,none,-5.0,68.0,66.0,43.000000,average
395,male,group A,high school,free/reduced,none,-10.0,45.0,41.0,25.333333,poor
527,female,group C,high school,free/reduced,none,145.0,53.0,43.0,80.333333,excellent
555,female,group C,some college,free/reduced,none,150.0,39.0,33.0,74.000000,good
666,female,group C,some college,free/reduced,completed,200.0,73.0,71.0,114.666667,NaN

In [125]:
# df.index consists of all the row numbers in the dataset
# invalid-scores.index stores all the wrong or "invalid value" row numbers
# the invalid row numbers are marked as TRUE and the valid rows as FALSE
# To invert this and make the valid rows as TRUE, the NOT (~) operator is used
# this shows only the valid rows and invalid rows are removed
df = df[~df.index.isin(invalid_scores.index)]

In [126]:
df.shape

(853, 10)

In [127]:
df["average_score"] = df[["math_score","reading_score","writing_score"]].mean(axis=1)

In [128]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,average_score,performance_category
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,72.666667,good
1,female,group C,some college,standard,completed,69.0,90.0,88.0,82.333333,excellent
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,92.666667,excellent
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,49.333333,average
4,male,group C,some college,standard,none,76.0,78.0,75.0,76.333333,good

### Final Sanity Check

In [129]:
df.describe()

       math_score  reading_score  writing_score  average_score
count  853.000000     853.000000     853.000000     853.000000
mean    66.237984      69.352872      68.227433      67.939429
std     14.737240      14.431024      14.969761      13.970724
min     18.000000      23.000000      15.000000      23.000000
25%     57.000000      59.000000      58.000000      58.333333
50%     66.000000      70.000000      69.000000      68.666667
75%     76.000000      79.000000      79.000000      77.666667
max    100.000000     100.000000     100.000000     100.000000

In [130]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,average_score,performance_category
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,72.666667,good
1,female,group C,some college,standard,completed,69.0,90.0,88.0,82.333333,excellent
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,92.666667,excellent
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,49.333333,average
4,male,group C,some college,standard,none,76.0,78.0,75.0,76.333333,good

In [133]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,average_score,performance_category
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,72.666667,good
1,female,group C,some college,standard,completed,69.0,90.0,88.0,82.333333,excellent
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,92.666667,excellent
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,49.333333,average
4,male,group C,some college,standard,none,76.0,78.0,75.0,76.333333,good

In [134]:
df.describe()

       math_score  reading_score  writing_score  average_score
count  853.000000     853.000000     853.000000     853.000000
mean    66.237984      69.352872      68.227433      67.939429
std     14.737240      14.431024      14.969761      13.970724
min     18.000000      23.000000      15.000000      23.000000
25%     57.000000      59.000000      58.000000      58.333333
50%     66.000000      70.000000      69.000000      68.666667
75%     76.000000      79.000000      79.000000      77.666667
max    100.000000     100.000000     100.000000     100.000000

In [135]:
df.shape

(853, 10)

### Connect to Mysql or PostgreSQL for eda